package com.gmail.baranovsky0803.additional_tasks;

/*  Напишите программу вывода всех четных чисел от 2 до 100 включительно    */

public class Task_13 {
    public static void main(String[] args) {

        //  Вывод четных чисел
        for (int i = 2; i <= 100; i += 2) {
            System.out.println(i);
        }
    }
}

